# ТЗ колво строк со словами с ! и колво слов с ! и максимальное кол-во подходящих слов в строке

f = open('middleone.txt')

kl = 0 #Кол-во подходящих строк
kw = 0 #Кол-во подходящих слов
mkw = 0 #Максимальное кол-во подходящих слов в строке




for s in f:
	a = 0 
	for m in 'а','б','в','г','д','е','ё','ж','з','и','й','к','л','м','н','о','п','р','с','т','у','ф','х','ц','ч','ш','щ','ъ','ы','ь','э','ю','я':
		kw = kw + s.count(m+'!')
		a = a + s.count(m+'!')
	mkw = max(mkw,a)
	if a > 0:
		kl += 1


print(mkw, kl)